docs/posts/2015-03-07-crucified-god-chapter-2.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Mar 29, 2025 13:16 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Cross-Shattered Christ, Chapter 2</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link href='/pagefind/pagefind-ui.css' rel='stylesheet'>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/atom.xml">Feed</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">The Cross-Shattered Christ, Chapter 2</h1>
<p class="subtitle" role="doc-subtitle">Mar 07, 2015 00:00</p>
</header><p>
I struggled with the second chapter of Hauerwas&rsquo; book, <i>The Cross-Shattered Christ</i><sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>, not because the chapter was particularly hard to follow, but because it forced me to reflect on my life as a teacher and minister. The chapter opened with a discussion of the reticence of the Gospels, why do they not tell us everything that we want to know? Why is Jesus simply silent on what many of us think are the most important questions of the day? We tend to be uncomfortable during times of silence, so we attempt to fill in the gaps, even when we have little of value to say. In much the same way, we are often uncomfortable with uncertainty, that is, being faced with questions for which we have no clear answers, so we take on the role of spokespeople for Christ. 
</p>

<p>
Hauerwas points out the presumptuousness of this: &ldquo;Our attempt to speak confidently of God in the face of modern skepticism, a skepticism we suspect also grips our lives as Christians, betrays a certainty inappropriate for a people who worship a crucified God.&rdquo;
</p>

<p>
One thing that I love about my job is the significant conversations that I have with colleagues and students. At lunch yesterday, I felt the discomfort of having no answer when asked about how to respond to particularly difficult questions asked by sincere followers of other religions.
</p>

<p>
It&rsquo;s not that I have nothing to say, it&rsquo;s rather that what I have to say seems insufficient for the task at hand. All of my clear and concise explanations suddenly seem incomplete and inadequate in the shadow the Cross of the Crucified One.
</p>

<div class="tagline" id="org6bdded0">
<p>
Tagged: <a href="../tags/religion.html">Religion</a>
</p>

</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes</h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Hauerwas, Stanley (2005-01-01). <i>Cross-Shattered Christ: Meditations on the Seven Last Words</i> (p. 18). Baker Publishing Group. Kindle Edition.
</p></div></div>


</div>
</div></main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Mar 29, 2025 13:16.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.1 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
